tap "adoptopenjdk/openjdk"
tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
# Search tool like grep, but optimized for programmers
brew "ack"
# Java build tool
brew "ant"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Fish completion for brew-cask
brew "brew-cask-completion"
# Cross-platform make
brew "cmake"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Modern replacement for 'ls'
brew "exa"
# Library for command-line editing
brew "readline"
# Easiest way to build and release mobile apps
brew "fastlane"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# GitHub command-line tool
brew "gh"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Git extension for versioning large files
brew "git-lfs"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go version management
brew "goenv"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Kubernetes command-line interface
brew "kubernetes-cli", link: false
# X.509 and CMS library
brew "libksba"
# Generic library support script
brew "libtool"
# Command-line interface for SQLite
brew "sqlite"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Node version management
brew "n"
# HTTP/2 C Library
brew "nghttp2"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Platform built on V8 to build network applications
brew "node", link: false
# Object-relational database system
brew "postgresql"
# Python version management
brew "pyenv"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Cross-shell prompt for astronauts
brew "starship"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extraction utility for .zip compressed archives
brew "unzip"
# Vi 'workalike' with many additional features
brew "vim"
# Watch files and take action when they change
brew "watchman"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# SDK
brew "dart-lang/dart/dart"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Prebuilt OpenJDK binaries
cask "adoptopenjdk8"
# Toolset to implement parts of Android apps in native code
cask "android-ndk"
# Android SDK component
cask "android-platform-tools"
cask "android-sdk"
# Tools for building Android applications
cask "android-studio"
# Allows connection to a computer remotely
cask "anydesk"
# Application uninstaller
cask "appcleaner"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Tool to hide status bar icons
cask "dozer"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
cask "font-hack-nerd-font"
# GIT client
cask "fork"
# Download accelerator and organizer
cask "free-download-manager"
# Web browser
cask "google-chrome"
# Finder Toolbar app to open the current directory in Terminal or Editor
cask "openinterminal"
# GUI client for PostgreSQL databases
cask "postico"
# Collaboration platform for API development
cask "postman"
# Move and resize windows with ease
cask "spectacle"
# Music streaming service
cask "spotify"
# Native GUI tool for relational databases
cask "tableplus"
# Tool to install Linux/BSD distributions to a partition or USB drive
cask "unetbootin"
# Multimedia player
cask "vlc"

mas "DevCleaner", id: 1388020431
mas "Developer", id: 640199958
mas "HazeOver", id: 430798174
mas "HiddenMe", id: 467040476
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "LINE", id: 539883307
mas "LiquidText", id: 922765270
mas "Magnet", id: 441258766
mas "Messenger", id: 1480068668
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Redis Server", id: 972359186
mas "Shazam", id: 897118787
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "Transporter", id: 1450874784
mas "Xcode", id: 497799835
